Tekla Open API Reference for Tekla Structures 2025
BendSurfaceNode Constructor
 Initializes a new instance of the BendSurfaceNode class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BendSurfaceNode(
	BendSurface surface
)
Public Sub New (
	surface As BendSurface
)
Parameters
surface
Type: Tekla.Structures.Model.BendSurface
The contour of the node.
See Also
Reference
BendSurfaceNode Class
Tekla.Structures.Model Namespace